<?php

use Illuminate\Database\Seeder;

class RegionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('regions')->truncate();

        $region = [
            ['name' => 'Город Нур-Султан'],
            ['name' => 'Город Алматы'],
            ['name' => 'Город Шымкент'],
            ['name' => 'Акмолинская область'],
            ['name' => 'Актюбинская область'],
            ['name' => 'Алматинская область'],
            ['name' => 'Атырауская область'],
            ['name' => 'Восточно-Казахстанская область'],
            ['name' => 'Жамбылская область'],
            ['name' => 'Западно-Казахстанская область'],
            ['name' => 'Карагандинская область'],
            ['name' => 'Костанайская область'],
            ['name' => 'Кызылординская область'],
            ['name' => 'Мангистауская область'],
            ['name' => 'Павлодарская область'],
            ['name' => 'Северо-Казахстанская область'],
            ['name' => 'Туркестанская область'],
        ];

        DB::table('regions')->insert($region);
    }
}
